mu4e-notifications.org
* mu4e-notifications
This document describes a method to enable desktop notifications that open the message to which they are associated in mu4e. Since you are an emacs user, I recommend that you read this guide as an org-mode file. Get the org-mode version of this document [[https://raw.githubusercontent.com/IvanMalison/mu4e-notifications/master/mu4e-notifications.org][here]]. 

** Assumptions/Dependencies
*** mu/mu4e
    You can get mu with mu4e from homebrew using:
#+BEGIN_SRC sh
  brew install mu --with-emacs
#+END_SRC
Make sure to add the mu4e source directory to your load path. If you installed using homebrew, you can use the following snippet to do so:
#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path
   (concat (replace-regexp-in-string "\n" "" (shell-command-to-string "echo $(brew --prefix mu)"))
           "/share/emacs/site-lisp/mu4e"))
  (require 'mu4e)
#+END_SRC
If you use jwiegley's use-package instead of a raw require, make sure that ~mu4e-view-message-with-msgid~ triggers the loading of mu4e.
insert link about mu4e configuration

*** terminal-notifier
    Which means that this guide is OSX (10.9+ since advanced terminal-notifier features are used) specific (though it should be relatively easy to generalize this procedure to other environments like Linux with GNOME or KDE). You can install terminal-notifier with homebrew:
#+BEGIN_SRC sh
  brew install terminal-notifier
#+END_SRC
*** Cocoa emacs, emacsclient
    This method talks to emacs using emacsclient -e to execute code in the emacs session, which requires that you run your emacs session using ~emacs --daemon~ (or using ~M-x start-server~ once emacs is already started) and ~emacsclient~. You should already be doing this anyway.
    Cocoa emacs, though not strictly required, is needed in order to provide a bundle target to terminal-notifier to switch the focus to.
*** reattach-to-user-namespace
    This is needed to be able to send notifications from a process that was started outside of the user's GUI login session in MacOSX. You can also get this from homebrew
#+BEGIN_SRC sh
  brew install reattach-to-user-namespace
#+END_SRC
*** Maildir synchronization system
    The author currently uses offlineimap, but using another system (such as mbsync/isync) should be as simple as changing an environment variable. You can get both offlineimap and isync from homebrew:
#+BEGIN_SRC sh
  brew install offlineimap
#+END_SRC
** Setup
*** Talking to emacs
Ensure that you can talk to your running emacs instance using emacsclient. Choose one of the two following methods:
**** Using emacsclient by itself
If you prefer not to use ~server-use-tcp~ (as described below) you must define the shell function ~execute_elisp~ to run code in your existing emacs session. Typically, this will simply look like 
#+BEGIN_SRC sh
alias execute_elisp='emacsclient -e'
#+END_SRC
**** Using server-file-name and server-use-tcp
The author puts the following:
#+BEGIN_SRC elisp
  (setq server-use-tcp t)
#+END_SRC
in their emacs configuration, which makes it so that when ~emacs --daemon=server-file-name~ is used to start the emacs daemon, a server-file with the name ~server-file-name~ is added to ~$HOME/.emacs.d/server~. If you do this, you can use the following functions to communicate with your emacs instances:
#+BEGIN_SRC sh
  function execute_elisp {
      emacs_get_running_instances | xargs -I svr-filename emacsclient --server-file=svr-filename -e "$1"
  }

  function emacs_pids {
      # If -i causes errors (as it can with some versions of pgrep), you can use
      # ps aux | grep emacs | grep -v grep | awk '{print $2}'
      pgrep -i emacs
  }

  function emacs_get_running_instances {
      emacs_pids | xargs ps -o command -p | egrep -o " --daemon=(.*)" | awk -F= '{print $2}' | sed 's/\^J3,4\^J//'
  }
#+END_SRC
See [[https://raw.githubusercontent.com/IvanMalison/dotfiles/master/dotfiles/lib/shellenv/emacs.sh][my emacs shell functions]] for more details about how to get this type of setup working.
