mu4e-notifications.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>mu4e-notifications</title>
<!-- 2014-12-19 Fri 22:51 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ivan Malison" />
</head>
<body>
<div id="content">
<h1 class="title">mu4e-notifications</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. mu4e-notifications</a>
<ul>
<li><a href="#sec-1-1">1.1. Assumptions/Dependencies</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. mu/mu4e</a></li>
<li><a href="#sec-1-1-2">1.1.2. terminal-notifier</a></li>
<li><a href="#sec-1-1-3">1.1.3. Cocoa emacs, emacsclient</a></li>
<li><a href="#sec-1-1-4">1.1.4. reattach-to-user-namespace</a></li>
<li><a href="#sec-1-1-5">1.1.5. Maildir synchronization system</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Setup</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Talking to emacs</a></li>
<li><a href="#sec-1-2-2">1.2.2. Alerting</a></li>
<li><a href="#sec-1-2-3">1.2.3. mu4e Patch</a></li>
<li><a href="#sec-1-2-4">1.2.4. Make a LaunchAgent</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> mu4e-notifications</h2>
<div class="outline-text-2" id="text-1">
<p>
This document describes a method to enable desktop notifications that open the message to which they are associated in mu4e.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Assumptions/Dependencies</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> mu/mu4e</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
You can get mu with mu4e from homebrew using:
</p>
<div class="org-src-container">

<pre class="src src-sh">brew install mu --with-emacs
</pre>
</div>
<p>
Make sure to add the mu4e source directory to your load path. If you installed using homebrew, you can use the following snippet to do so:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99d1ce;">(</span>add-to-list 'load-path
 <span style="color: #c23127;">(</span>concat <span style="color: #33859e;">(</span>replace-regexp-in-string <span style="color: #2aa889;">"\n"</span> <span style="color: #2aa889;">""</span> <span style="color: #d26937;">(</span>shell-command-to-string <span style="color: #2aa889;">"echo $(brew --prefix mu)"</span><span style="color: #d26937;">)</span><span style="color: #33859e;">)</span>
         <span style="color: #2aa889;">"/share/emacs/site-lisp/mu4e"</span><span style="color: #c23127;">)</span><span style="color: #99d1ce;">)</span>
<span style="color: #99d1ce;">(</span><span style="color: #195466; font-weight: bold;">require</span> '<span style="color: #33859e; font-weight: bold;">mu4e</span><span style="color: #99d1ce;">)</span>
</pre>
</div>
<p>
If you use jwiegley's use-package instead of a raw require, make sure that <code>mu4e-view-message-with-msgid</code> triggers the loading of mu4e.
insert link about mu4e configuration
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> terminal-notifier</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Which means that this guide is OSX (10.9+ since advanced terminal-notifier features are used) specific (though it should be relatively easy to generalize this procedure to other environments like Linux with GNOME or KDE). You can install terminal-notifier with homebrew:
</p>
<div class="org-src-container">

<pre class="src src-sh">brew install terminal-notifier
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Cocoa emacs, emacsclient</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
This method talks to emacs using emacsclient -e to execute code in the emacs session, which requires that you run your emacs session using <code>emacs --daemon</code> (or using <code>M-x start-server</code> once emacs is already started) and <code>emacsclient</code>. You should already be doing this anyway.
Cocoa emacs, though not strictly required, is needed in order to provide a bundle target to terminal-notifier to switch the focus to.
</p>
</div>
</div>
<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> reattach-to-user-namespace</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
This is needed to be able to send notifications from a process that was started outside of the user's GUI login session in MacOSX. You can also get this from homebrew
</p>
<div class="org-src-container">

<pre class="src src-sh">brew install reattach-to-user-namespace
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-1-5" class="outline-4">
<h4 id="sec-1-1-5"><span class="section-number-4">1.1.5</span> Maildir synchronization system</h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
The author currently uses offlineimap, but using another system (such as mbsync/isync) should be as simple as changing an environment variable. You can get both offlineimap and isync from homebrew:
</p>
<div class="org-src-container">

<pre class="src src-sh">brew install offlineimap
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Setup</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Talking to emacs</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Ensure that you can talk to your running emacs instance using emacsclient. Choose one of the two following methods:
</p>
</div>
<ol class="org-ol"><li><a id="sec-1-2-1-1" name="sec-1-2-1-1"></a>Using emacsclient by itself<br  /><div class="outline-text-5" id="text-1-2-1-1">
<p>
If you prefer not to use <code>server-use-tcp</code> (as described below) you must define the shell function <code>execute_elisp</code> to run code in your existing emacs session. Typically, this will simply look like 
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #d26937;">alias</span> <span style="color: #599cab;">execute_elisp</span>=<span style="color: #2aa889;">'emacsclient -e'</span>
</pre>
</div>
</div>
</li>
<li><a id="sec-1-2-1-2" name="sec-1-2-1-2"></a>Using server-file-name and server-use-tcp<br  /><div class="outline-text-5" id="text-1-2-1-2">
<p>
The author puts the following:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #99d1ce;">(</span>setq server-use-tcp t<span style="color: #99d1ce;">)</span>
</pre>
</div>
<p>
in their emacs configuration, which makes it so that when <code>emacs --daemon=server-file-name</code> is used to start the emacs daemon, a server-file with the name <code>server-file-name</code> is added to <code>$HOME/.emacs.d/server</code>. If you do this, you can use the following functions to communicate with your emacs instances:
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #195466; font-weight: bold;">function</span> <span style="color: #599cab;">execute_elisp</span> <span style="color: #99d1ce;">{</span>
    emacs_get_running_instances | xargs -I svr-filename emacsclient --server-file=svr-filename -e <span style="color: #2aa889;">"$1"</span>
<span style="color: #99d1ce;">}</span>

<span style="color: #195466; font-weight: bold;">function</span> <span style="color: #599cab;">emacs_pids</span> <span style="color: #99d1ce;">{</span>
    <span style="color: #245361;"># </span><span style="color: #245361;">If -i causes errors (as it can with some versions of pgrep), you can use</span>
    <span style="color: #245361;"># </span><span style="color: #245361;">ps aux | grep emacs | grep -v grep | awk '{print $2}'</span>
    pgrep -i emacs
<span style="color: #99d1ce;">}</span>

<span style="color: #195466; font-weight: bold;">function</span> <span style="color: #599cab;">emacs_get_running_instances</span> <span style="color: #99d1ce;">{</span>
    emacs_pids | xargs ps -o command -p | egrep -o <span style="color: #2aa889;">" --daemon=(.*)"</span> | awk -F= <span style="color: #2aa889;">'{print $2}'</span> | sed <span style="color: #2aa889;">'s/\^J3,4\^J//'</span>
<span style="color: #99d1ce;">}</span>
</pre>
</div>
<p>
See <a href="https://raw.githubusercontent.com/IvanMalison/dotfiles/master/dotfiles/lib/shellenv/emacs.sh">my emacs shell functions</a> for more details about how to get this type of setup working.
</p>
</div>
</li></ol>
</div>
