mu4e-notifications.org
*** Alerting
Add the following functions to your shells configuration file (~.bashrc~ if you use bash), or otherwise make them accesible from your shell of choice:
#+BEGIN_SRC sh
  MAILDIR="$HOME/Mail/INBOX"
  SYNC_STAMP="$HOME/.mail-sync"
  APP_ICON="$HOME/gmail_logo.png" 
  SYNC_COMMAND="offlineimap"

  function mu4e_update_mail {
      $SYNC_COMMAND
      mu4e_update_index
      mu4e_alerts
  }

  function mu4e_alert_for_filename {
      local message="$(mu view $1 | grep -B 10 Date)"
      local title="$(echo $message | grep From | sed 's/From: //')"
      local subject="$(echo $message | grep Subject | sed 's/Subject: //')"
      local mu4e_message_id="$(mu4e_get_msg_id_from_file $1)"
      local view_file_command="$(which zsh) -c \"refresh_config && mu4e_view_message $mu4e_message_id\""
      local app_icon_argument=''
      test -e "$APP_ICON" && app_icon_argument="-appIcon '$APP_ICON'"
      reattach-to-user-namespace $(which terminal-notifier) \
          -title "$title" \
          -message "$subject" \
          -execute "$view_file_command" \
          -activate "org.gnu.Emacs" \
          $app_icon_argument
  }

  function mu4e_update_index {
      execute_elisp "(mu4e-update-index)"
  }

  function mu4e_alerts {
      test -e $SYNC_STAMP || touch $SYNC_STAMP
      touch "${SYNC_STAMP}.in-progress"
      for f in $(find "$MAILDIR" -cnewer "$SYNC_STAMP" -a -type f); do
          mu4e_alert_for_filename $f
      done
      mv "${SYNC_STAMP}.in-progress" $SYNC_STAMP
  }

  function mu4e_get_msg_id_from_file {
      mu view $1 -o sexp | grep "message-id" | awk '{print $2}' | sed 's/"//g'
  }

  function mu4e_view_message_from_file {
      mu4e_view_message "$(mu4e_get_msg_id_from_file $1)"
  }

  function mu4e_view_message {
      execute_elisp "(mu4e-view-message-with-msgid \"$1\")"
  }
#+END_SRC
Make sure to configure the ~MAILDIR~ and ~SYNC_COMMAND~ environment variables to match your configuration. Also, make sure that ~execute_elisp~, the function defined in the previous section is available whenever these functions are called.
**** Testing alerting
     To make sure that everything is working, send yourself some mail that will end up in whatever you set as ~$MAILDIR~, and run the ~mu4e_update_mail~ command. You should see some notification center popups. Don't try clicking on them just yet.

