mu4e-notifications.html
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Alerting</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Add the following functions to your shells configuration file (<code>.bashrc</code> if you use bash), or otherwise make them accesible from your shell of choice:
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #599cab;">MAILDIR</span>=<span style="color: #2aa889;">"$HOME/Mail/INBOX"</span>
<span style="color: #599cab;">SYNC_STAMP</span>=<span style="color: #2aa889;">"$HOME/.mail-sync"</span>
<span style="color: #599cab;">APP_ICON</span>=<span style="color: #2aa889;">"$HOME/gmail_logo.png"</span> 
<span style="color: #599cab;">SYNC_COMMAND</span>=<span style="color: #2aa889;">"offlineimap"</span>

<span style="color: #195466; font-weight: bold;">function</span> <span style="color: #599cab;">mu4e_update_mail</span> <span style="color: #99d1ce;">{</span>
    $<span style="color: #599cab;">SYNC_COMMAND</span>
    mu4e_update_index
    mu4e_alerts
<span style="color: #99d1ce;">}</span>

<span style="color: #195466; font-weight: bold;">function</span> <span style="color: #599cab;">mu4e_alert_for_filename</span> <span style="color: #99d1ce;">{</span>
    <span style="color: #d26937;">local</span> <span style="color: #599cab;">message</span>=<span style="color: #2aa889;">"$(mu view $1 | grep -B 10 Date)"</span>
    <span style="color: #d26937;">local</span> <span style="color: #599cab;">title</span>=<span style="color: #2aa889;">"$(echo $message | grep From | sed 's/From: //')"</span>
    <span style="color: #d26937;">local</span> <span style="color: #599cab;">subject</span>=<span style="color: #2aa889;">"$(echo $message | grep Subject | sed 's/Subject: //')"</span>
    <span style="color: #d26937;">local</span> <span style="color: #599cab;">mu4e_message_id</span>=<span style="color: #2aa889;">"$(mu4e_get_msg_id_from_file $1)"</span>
    <span style="color: #d26937;">local</span> <span style="color: #599cab;">view_file_command</span>=<span style="color: #2aa889;">"$(which zsh) -c \"refresh_config &amp;&amp; mu4e_view_message $mu4e_message_id\""</span>
    <span style="color: #d26937;">local</span> <span style="color: #599cab;">app_icon_argument</span>=<span style="color: #2aa889;">''</span>
    test -e <span style="color: #2aa889;">"$APP_ICON"</span> &amp;&amp; <span style="color: #599cab;">app_icon_argument</span> = <span style="color: #2aa889;">"-appIcon '$APP_ICON'"</span>
    reattach-to-user-namespace $<span style="color: #c23127;">(</span><span style="color: #d26937;">which</span> terminal-notifier<span style="color: #c23127;">)</span> <span style="color: #2aa889;">\</span>
        -title <span style="color: #2aa889;">"$title"</span> <span style="color: #2aa889;">\</span>
        -message <span style="color: #2aa889;">"$subject"</span> <span style="color: #2aa889;">\</span>
        -execute <span style="color: #2aa889;">"$view_file_command"</span> <span style="color: #2aa889;">\</span>
        -activate <span style="color: #2aa889;">"org.gnu.Emacs"</span> <span style="color: #2aa889;">\</span>
        $<span style="color: #599cab;">app_icon_argument</span>
<span style="color: #99d1ce;">}</span>

<span style="color: #195466; font-weight: bold;">function</span> <span style="color: #599cab;">mu4e_update_index</span> <span style="color: #99d1ce;">{</span>
    execute_elisp <span style="color: #2aa889;">"(mu4e-update-index)"</span>
<span style="color: #99d1ce;">}</span>

<span style="color: #195466; font-weight: bold;">function</span> <span style="color: #599cab;">mu4e_alerts</span> <span style="color: #99d1ce;">{</span>
    test -e $<span style="color: #599cab;">SYNC_STAMP</span> || touch $<span style="color: #599cab;">SYNC_STAMP</span>
    touch <span style="color: #2aa889;">"${SYNC_STAMP}.in-progress"</span>
    <span style="color: #195466; font-weight: bold;">for</span> f<span style="color: #195466; font-weight: bold;"> in</span> $<span style="color: #c23127;">(</span>find <span style="color: #2aa889;">"$MAILDIR"</span> -cnewer <span style="color: #2aa889;">"$SYNC_STAMP"</span> -a -type f<span style="color: #c23127;">)</span>; <span style="color: #195466; font-weight: bold;">do</span>
        mu4e_alert_for_filename $<span style="color: #599cab;">f</span>
    <span style="color: #195466; font-weight: bold;">done</span>
    mv <span style="color: #2aa889;">"${SYNC_STAMP}.in-progress"</span> $<span style="color: #599cab;">SYNC_STAMP</span>
<span style="color: #99d1ce;">}</span>

<span style="color: #195466; font-weight: bold;">function</span> <span style="color: #599cab;">mu4e_get_msg_id_from_file</span> <span style="color: #99d1ce;">{</span>
    mu view $<span style="color: #599cab;">1</span> -o sexp | grep <span style="color: #2aa889;">"message-id"</span> | awk <span style="color: #2aa889;">'{print $2}'</span> | sed <span style="color: #2aa889;">'s/"//g'</span>
<span style="color: #99d1ce;">}</span>

<span style="color: #195466; font-weight: bold;">function</span> <span style="color: #599cab;">mu4e_view_message_from_file</span> <span style="color: #99d1ce;">{</span>
    mu4e_view_message <span style="color: #2aa889;">"$(mu4e_get_msg_id_from_file $1)"</span>
<span style="color: #99d1ce;">}</span>

<span style="color: #195466; font-weight: bold;">function</span> <span style="color: #599cab;">mu4e_view_message</span> <span style="color: #99d1ce;">{</span>
    execute_elisp <span style="color: #2aa889;">"(mu4e-view-message-with-msgid \"$1\")"</span>
<span style="color: #99d1ce;">}</span>
</pre>
</div>
<p>
Make sure to configure the <code>MAILDIR</code> and <code>SYNC_COMMAND</code> environment variables to match your configuration. Also, make sure that <code>execute_elisp</code>, the function defined in the previous section is available whenever these functions are called.
</p>
</div>
<ol class="org-ol"><li><a id="sec-1-2-2-1" name="sec-1-2-2-1"></a>Testing alerting<br  /><div class="outline-text-5" id="text-1-2-2-1">
<p>
To make sure that everything is working, send yourself some mail that will end up in whatever you set as <code>$MAILDIR</code>, and run the <code>mu4e_update_mail</code> command. You should see some notification center popups. Don't try clicking on them just yet.
</p>
</div>
</li></ol>
</div>
