mu4e-notifications.org
*** mu4e Patch
Until [[https://github.com/djcb/mu/issues/547][this issue]] is resolved, you need to patch ~mu4e-view~ so that it displays the messages that are requested from outside of emacs properly.
#+BEGIN_SRC emacs-lisp
  (defun mu4e-view (msg headersbuf)
    "Display the message MSG in a new buffer, and keep in sync with HDRSBUF.
  'In sync' here means that moving to the next/previous message in
  the the message view affects HDRSBUF, as does marking etc.
   
  As a side-effect, a message that is being viewed loses its 'unread'
  marking if it still had that."
    (let* ((embedded ;; is it as an embedded msg (ie. message/rfc822 att)?
             (when (gethash (mu4e-message-field msg :path)
                     mu4e~path-parent-docid-map) t))
            (buf
              (if embedded
                (mu4e~view-embedded-winbuf)
                (get-buffer-create mu4e~view-buffer-name))))
      ;; note: mu4e~view-mark-as-read will pseudo-recursively call mu4e-view again
      ;; by triggering mu4e~view again as it marks the message as read
      (with-current-buffer buf
        (switch-to-buffer buf)
        (setq mu4e~view-msg msg)
        ;;                           |
        ;; This is the relevant line v
        (when t ;;(or embedded (not (mu4e~view-mark-as-read msg)))
          (let ((inhibit-read-only t))
            (erase-buffer)
            (mu4e~delete-all-overlays)
            (insert (mu4e-view-message-text msg))
            (goto-char (point-min))
            (mu4e~fontify-cited)
            (mu4e~fontify-signature)
            (mu4e~view-make-urls-clickable)       
            (mu4e~view-show-images-maybe msg)
            (setq
              mu4e~view-buffer buf
              mu4e~view-headers-buffer headersbuf)
            (when embedded (local-set-key "q" 'kill-buffer-and-window))
            (mu4e-view-mode))))))
#+END_SRC
**** Testing alerting
     Test alerting as before, but this time click on one of the notifications. The operating systems focus should be shifted to emacs, and the relevant email should be displayed.
*** Make a LaunchAgent
Save the following to ~$HOME/Library/LaunchAgents/org.imalison.mu4e-update-mail~ (make sure to give it ~chmod 644~ permissions)
#+BEGIN_SRC xml
  <?xml version="1.0" encoding="UTF-8"?>
  <!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
  <plist version="1.0">
  <dict>
      <key>Label</key>
      <string>org.imalison.mu4e-update-mail</string>
      <key>ProgramArguments</key>
      <array>
        <string>zsh</string>
        <string>-c</string>
          <string>source ~/.zshrc && mu4e_update_mail</string>
      </array>
      <key>StartInterval</key>
      <integer>30</integer>
      <key>StandardOutPath</key>
      <string>/tmp/org.imalison.mu4e-update-mail.out</string>
      <key>StandardErrorPath</key>
      <string>/tmp/org.imalison.mu4e-update-mail.error</string>
  </dict>
  </plist>
#+END_SRC

Typically, you need to log in and log out to have launchd load a new launchagent. You can also use the following functions to reload any launchagent:
#+BEGIN_SRC sh
  function as_user {
      local user="$1"
      local user_pid=$(ps -axj | awk "/^$user / {print \$2;exit}")
      local command="sudo /bin/launchctl bsexec $user_pid sudo -u '$user' $2"
      eval $command
  }

  function as_current_user {
      as_user "$(whoami)" "$*"
  }

  function reload_user_agent {
      as_current_user /bin/launchctl unload "$1"
      as_current_user /bin/launchctl load "$1"
  }
#+END_SRC
