mu4e-notifications.html

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> mu4e Patch</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Until <a href="https://github.com/djcb/mu/issues/547">this issue</a> is resolved, you need to patch <code>mu4e-view</code> so that it displays the messages that are requested from outside of emacs properly.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #99d1ce;">(</span><span style="color: #195466; font-weight: bold;">defun</span> <span style="color: #599cab;">mu4e-view</span> <span style="color: #c23127;">(</span>msg headersbuf<span style="color: #c23127;">)</span>
  <span style="color: #2aa889;">"Display the message MSG in a new buffer, and keep in sync with HDRSBUF.</span>
<span style="color: #2aa889;">'In sync' here means that moving to the next/previous message in</span>
<span style="color: #2aa889;">the the message view affects HDRSBUF, as does marking etc.</span>

<span style="color: #2aa889;">As a side-effect, a message that is being viewed loses its 'unread'</span>
<span style="color: #2aa889;">marking if it still had that."</span>
  <span style="color: #c23127;">(</span><span style="color: #195466; font-weight: bold;">let*</span> <span style="color: #33859e;">(</span><span style="color: #d26937;">(</span>embedded <span style="color: #245361;">;; </span><span style="color: #245361;">is it as an embedded msg (ie. message/rfc822 att)?</span>
           <span style="color: #2aa889;">(</span><span style="color: #195466; font-weight: bold;">when</span> <span style="color: #c23127;">(</span>gethash <span style="color: #33859e;">(</span>mu4e-message-field msg <span style="color: #d26937;">:path</span><span style="color: #33859e;">)</span>
                   mu4e~path-parent-docid-map<span style="color: #c23127;">)</span> t<span style="color: #2aa889;">)</span><span style="color: #d26937;">)</span>
          <span style="color: #d26937;">(</span>buf
            <span style="color: #2aa889;">(</span><span style="color: #195466; font-weight: bold;">if</span> embedded
              <span style="color: #c23127;">(</span>mu4e~view-embedded-winbuf<span style="color: #c23127;">)</span>
              <span style="color: #c23127;">(</span>get-buffer-create mu4e~view-buffer-name<span style="color: #c23127;">)</span><span style="color: #2aa889;">)</span><span style="color: #d26937;">)</span><span style="color: #33859e;">)</span>
    <span style="color: #245361;">;; </span><span style="color: #245361;">note: mu4e~view-mark-as-read will pseudo-recursively call mu4e-view again</span>
    <span style="color: #245361;">;; </span><span style="color: #245361;">by triggering mu4e~view again as it marks the message as read</span>
    <span style="color: #33859e;">(</span><span style="color: #195466; font-weight: bold;">with-current-buffer</span> buf
      <span style="color: #d26937;">(</span>switch-to-buffer buf<span style="color: #d26937;">)</span>
      <span style="color: #d26937;">(</span>setq mu4e~view-msg msg<span style="color: #d26937;">)</span>
      <span style="color: #245361;">;;                           </span><span style="color: #245361;">|</span>
      <span style="color: #245361;">;; </span><span style="color: #245361;">This is the relevant line v</span>
      <span style="color: #d26937;">(</span><span style="color: #195466; font-weight: bold;">when</span> t <span style="color: #245361;">;;</span><span style="color: #245361;">(or embedded (not (mu4e~view-mark-as-read msg)))</span>
        <span style="color: #2aa889;">(</span><span style="color: #195466; font-weight: bold;">let</span> <span style="color: #c23127;">(</span><span style="color: #33859e;">(</span>inhibit-read-only t<span style="color: #33859e;">)</span><span style="color: #c23127;">)</span>
          <span style="color: #c23127;">(</span>erase-buffer<span style="color: #c23127;">)</span>
          <span style="color: #c23127;">(</span>mu4e~delete-all-overlays<span style="color: #c23127;">)</span>
          <span style="color: #c23127;">(</span>insert <span style="color: #33859e;">(</span>mu4e-view-message-text msg<span style="color: #33859e;">)</span><span style="color: #c23127;">)</span>
          <span style="color: #c23127;">(</span>goto-char <span style="color: #33859e;">(</span>point-min<span style="color: #33859e;">)</span><span style="color: #c23127;">)</span>
          <span style="color: #c23127;">(</span>mu4e~fontify-cited<span style="color: #c23127;">)</span>
          <span style="color: #c23127;">(</span>mu4e~fontify-signature<span style="color: #c23127;">)</span>
          <span style="color: #c23127;">(</span>mu4e~view-make-urls-clickable<span style="color: #c23127;">)</span>       
          <span style="color: #c23127;">(</span>mu4e~view-show-images-maybe msg<span style="color: #c23127;">)</span>
          <span style="color: #c23127;">(</span>setq
            mu4e~view-buffer buf
            mu4e~view-headers-buffer headersbuf<span style="color: #c23127;">)</span>
          <span style="color: #c23127;">(</span><span style="color: #195466; font-weight: bold;">when</span> embedded <span style="color: #33859e;">(</span>local-set-key <span style="color: #2aa889;">"q"</span> 'kill-buffer-and-window<span style="color: #33859e;">)</span><span style="color: #c23127;">)</span>
          <span style="color: #c23127;">(</span>mu4e-view-mode<span style="color: #c23127;">)</span><span style="color: #2aa889;">)</span><span style="color: #d26937;">)</span><span style="color: #33859e;">)</span><span style="color: #c23127;">)</span><span style="color: #99d1ce;">)</span>
</pre>
</div>
</div>
<ol class="org-ol"><li><a id="sec-1-2-3-1" name="sec-1-2-3-1"></a>Testing alerting<br  /><div class="outline-text-5" id="text-1-2-3-1">
<p>
Test alerting as before, but this time click on one of the notifications. The operating systems focus should be shifted to emacs, and the relevant email should be displayed.
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> Make a LaunchAgent</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
Save the following to <code>$HOME/Library/LaunchAgents/org.imalison.mu4e-update-mail</code> (make sure to give it <code>chmod 644</code> permissions)
</p>
<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #195466; font-weight: bold;">xml</span> <span style="color: #599cab;">version</span>=<span style="color: #2aa889;">"</span><span style="color: #2aa889;">1.0</span><span style="color: #2aa889;">"</span> <span style="color: #599cab;">encoding</span>=<span style="color: #2aa889;">"</span><span style="color: #2aa889;">UTF-8</span><span style="color: #2aa889;">"</span>?&gt;
&lt;!<span style="color: #195466; font-weight: bold;">DOCTYPE</span> plist <span style="color: #195466; font-weight: bold;">PUBLIC</span> <span style="color: #2aa889;">"</span><span style="color: #2aa889;">-//Apple//DTD PLIST 1.0//EN</span><span style="color: #2aa889;">"</span> <span style="color: #2aa889;">"</span><span style="color: #2aa889;">http://www.apple.com/DTDs/PropertyList-1.0.dtd</span><span style="color: #2aa889;">"</span>&gt;
&lt;<span style="color: #599cab;">plist</span> <span style="color: #599cab;">version</span>=<span style="color: #2aa889;">"</span><span style="color: #2aa889;">1.0</span><span style="color: #2aa889;">"</span>&gt;
&lt;<span style="color: #599cab;">dict</span>&gt;
    &lt;<span style="color: #599cab;">key</span>&gt;Label&lt;/<span style="color: #599cab;">key</span>&gt;
    &lt;<span style="color: #599cab;">string</span>&gt;org.imalison.mu4e-update-mail&lt;/<span style="color: #599cab;">string</span>&gt;
    &lt;<span style="color: #599cab;">key</span>&gt;ProgramArguments&lt;/<span style="color: #599cab;">key</span>&gt;
    &lt;<span style="color: #599cab;">array</span>&gt;
      &lt;<span style="color: #599cab;">string</span>&gt;zsh&lt;/<span style="color: #599cab;">string</span>&gt;
      &lt;<span style="color: #599cab;">string</span>&gt;-c&lt;/<span style="color: #599cab;">string</span>&gt;
        &lt;<span style="color: #599cab;">string</span>&gt;source ~/.zshrc &amp;&amp; mu4e_update_mail&lt;/<span style="color: #599cab;">string</span>&gt;
    &lt;/<span style="color: #599cab;">array</span>&gt;
    &lt;<span style="color: #599cab;">key</span>&gt;StartInterval&lt;/<span style="color: #599cab;">key</span>&gt;
    &lt;<span style="color: #599cab;">integer</span>&gt;30&lt;/<span style="color: #599cab;">integer</span>&gt;
    &lt;<span style="color: #599cab;">key</span>&gt;StandardOutPath&lt;/<span style="color: #599cab;">key</span>&gt;
    &lt;<span style="color: #599cab;">string</span>&gt;/tmp/org.imalison.mu4e-update-mail.out&lt;/<span style="color: #599cab;">string</span>&gt;
    &lt;<span style="color: #599cab;">key</span>&gt;StandardErrorPath&lt;/<span style="color: #599cab;">key</span>&gt;
    &lt;<span style="color: #599cab;">string</span>&gt;/tmp/org.imalison.mu4e-update-mail.error&lt;/<span style="color: #599cab;">string</span>&gt;
&lt;/<span style="color: #599cab;">dict</span>&gt;
&lt;/<span style="color: #599cab;">plist</span>&gt;
</pre>
</div>

<p>
Typically, you need to log in and log out to have launchd load a new launchagent. You can also use the following functions to reload any launchagent:
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #195466; font-weight: bold;">function</span> <span style="color: #599cab;">as_user</span> <span style="color: #99d1ce;">{</span>
    <span style="color: #d26937;">local</span> <span style="color: #599cab;">user</span>=<span style="color: #2aa889;">"$1"</span>
    <span style="color: #d26937;">local</span> <span style="color: #599cab;">user_pid</span>=$<span style="color: #c23127;">(</span>ps -axj | awk <span style="color: #2aa889;">"/^$user / {print \$2;exit}"</span><span style="color: #c23127;">)</span>
    <span style="color: #d26937;">local</span> <span style="color: #599cab;">command</span>=<span style="color: #2aa889;">"sudo /bin/launchctl bsexec $user_pid sudo -u '$user' $2"</span>
    <span style="color: #d26937;">eval</span> $<span style="color: #599cab;">command</span>
<span style="color: #99d1ce;">}</span>

<span style="color: #195466; font-weight: bold;">function</span> <span style="color: #599cab;">as_current_user</span> <span style="color: #99d1ce;">{</span>
    as_user <span style="color: #2aa889;">"$(whoami)"</span> <span style="color: #2aa889;">"$*"</span>
<span style="color: #99d1ce;">}</span>

<span style="color: #195466; font-weight: bold;">function</span> <span style="color: #599cab;">reload_user_agent</span> <span style="color: #99d1ce;">{</span>
    as_current_user /bin/launchctl unload <span style="color: #2aa889;">"$1"</span>
    as_current_user /bin/launchctl load <span style="color: #2aa889;">"$1"</span>
<span style="color: #99d1ce;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ivan Malison</p>
<p class="date">Created: 2014-12-19 Fri 22:51</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
